Mathonix/AT32F423_LSM6DSV/src/app/main.c
/**
 * AT32F423KCU7-4 + LSM6DSV
 *   IMU HA01 2000 Hz + IST8310 50 Hz, 9D VQF, DAP live telemetry
 */

#include "at32f423_clock.h"
#include "bsp.h"
#include "lsm6dsv.h"
#include "ist8310.h"
#include "ws2812.h"
#include "vqf.h"
#include "app_config.h"
#include "vqf_live.h"
#include "mag_calibration.h"
#include "acc_calibration.h"
#include "gyro_bias_history.h"
#include "can_test.h"
#include "usb_cdc.h"
#include "protocol.h"
#include "fusion_settings.h"

#include <math.h>
#include <string.h>

#define FUSION_RATE_HZ       APP_FUSION_HZ
#define FUSION_HZ            ((float)FUSION_RATE_HZ)
#if (APP_VOFA_OUTPUT_HZ == 0U)
#error "APP_VOFA_OUTPUT_HZ must be non-zero"
#elif (APP_VOFA_OUTPUT_HZ > APP_FUSION_HZ)
#error "APP_VOFA_OUTPUT_HZ cannot exceed APP_FUSION_HZ"
#elif ((APP_FUSION_HZ % APP_VOFA_OUTPUT_HZ) != 0U)
#error "APP_VOFA_OUTPUT_HZ must divide APP_FUSION_HZ exactly"
#endif
#define OUTPUT_DIV           (FUSION_RATE_HZ / APP_VOFA_OUTPUT_HZ)
#define DAP_OUTPUT_HZ        ((APP_VOFA_OUTPUT_HZ < 20U) ? APP_VOFA_OUTPUT_HZ : 20U)
#if ((APP_FUSION_HZ % DAP_OUTPUT_HZ) != 0U)
#error "DAP_OUTPUT_HZ must divide APP_FUSION_HZ exactly"
#endif
#define DAP_OUTPUT_DIV       ((FUSION_RATE_HZ >= DAP_OUTPUT_HZ) ? (FUSION_RATE_HZ / DAP_OUTPUT_HZ) : 1U)
#define YAW_KF_SYNC_DIV      1U   /* VOFA output is now the synchronized 200 Hz stream */

#define GYR_DPS_PER_LSB      0.035f /* LSM6DSV CTRL6 FS_G=0011, +/-1000 dps */
#define ACC_G_PER_LSB        0.000122f
#define DEG2RAD              0.017453292519943295f
#define G_TO_MS2             9.80665f
#define SAMPLE_DT_CYCLES     ((uint32_t)(system_core_clock / (uint32_t)FUSION_HZ))
#define DROP_DT_CYCLES       ((SAMPLE_DT_CYCLES * 3U) / 2U)
#define CAL_GYR_REST_DPS APP_CAL_GYR_REST_DPS
#define CAL_ACC_REST_MS2 APP_CAL_ACC_REST_MS2
#define CAL_REST_SECONDS APP_CAL_REST_SECONDS   /* startup stationary bias calibration */
#define CAL_DROP_MS      APP_CAL_DROP_MS        /* startup settling/discard time */
#define CAL_BIAS_TEMP_WINDOW_C APP_GYR_BIAS_TEMP_WINDOW_C
#define GYR_LPF_CUTOFF_HZ APP_GYR_LPF_CUTOFF_HZ /* reduce gyro noise before integration */
#define ERR_STREAK_RECOVER   20U
#define MAG_PERIOD_N         40U /* read IST8310 at 50 Hz */
#define MAG_VQF_DIV          APP_MAG_VQF_UPDATE_DIV /* Full VQF update at 10 Hz */
#define MAG_FUSION_ENABLE    APP_MAG_FUSION_ENABLE
#define MAG_TIMEOUT_N        30U
#define MAG_UT_PER_LSB       0.3f

/* Startup calibration is performed on equal-duration block means.  Sorting
 * and trimming the outer blocks rejects knocks and short motion bursts while
 * retaining the configured multi-second calibration duration. */
#define CAL_BLOCK_SAMPLES     APP_CAL_BLOCK_SAMPLES
#define CAL_BLOCK_MAX         APP_CAL_BLOCK_MAX
#define CAL_TRIM_PERCENT      APP_CAL_TRIM_PERCENT

static float cal_gyr_blocks[3][CAL_BLOCK_MAX];
static float cal_acc_blocks[3][CAL_BLOCK_MAX];
/* Separate raw capture ABI; leaves existing attitude telemetry unchanged. */
volatile struct {
  uint32_t magic, seq, millis, sample_n, fusion_enabled;
  int32_t x, y, z;
} mag_raw_live = {0x4D524157U, 0U, 0U, 0U, MAG_FUSION_ENABLE, 0, 0, 0};

/* Separate 36-byte coherent ABI; legacy ax/ay/az remain nominal raw g. */
volatile struct {
  uint32_t magic, seq, millis;
  float raw_g[3], corrected_g[3];
} acc_cal_live = {0x4143434CU, 0U, 0U, {0}, {0}};

volatile struct {
  uint32_t magic, seq, millis;
  int16_t raw_temp;
  int16_t reserved;
  float temperature_c;
} imu_temp_live = {0x54454D50U, 0U, 0U, 0, 0, 25.0f};

/* Output VOFA/DAPLink pose ABI. Only yaw is KF-filtered; other fields are raw. */
volatile struct {
  uint32_t magic, seq, millis;
  float yaw, pitch, roll, temperature_c;
} vofa_pose_live = {0x56504F53U, 0U, 0U, 0.0f, 0.0f, 0.0f, 25.0f};

volatile vqf_live_t vqf_live;
volatile vqf_tune_live_t vqf_tune_live;
volatile yaw_kf_sync_live_t yaw_kf_sync_live = {
  YAW_KF_SYNC_MAGIC, 0U, 0U, 0.0f, 0.0f, 0.0f, 0.0f, 0U, 0U,
  APP_GYR_TEMP_REF_C, 0.0f, 0.0f
};
/* Separate ABI: preserves all existing tune/VOFA layouts. */
volatile struct {
  uint32_t magic, seq;
  vqf_tune_live_t snapshot;
  float diagnostic[8]; /* yaw6, refNorm, refDipDeg, rejectT, candidateT,
                       * corrRateDegS, disagreementDeg, biasSigmaDegS */
} vqf_nine_live = {0x39565146U, 0U, {0}, {0}};

#define VOFA_N_CH   3U
#define VOFA_BYTES  ((VOFA_N_CH * 4U) + 4U)

static uint8_t vofa_dma[2][VOFA_BYTES];
static uint8_t vofa_sel;
static uint32_t vofa_late;

static float wrap_deg(float angle)
{
  while(angle > 180.0f) angle -= 360.0f;
  while(angle < -180.0f) angle += 360.0f;
  return angle;
}

static float app_yaw_offset = 0.0f;
static void app_zero_yaw(float current_yaw)
{
  app_yaw_offset = wrap_deg(app_yaw_offset + current_yaw);
}

/* UART and USB CDC accept the same framed host-command protocol. */
typedef enum
{
  PROTOCOL_SOURCE_UART = 0,
  PROTOCOL_SOURCE_USB = 1
} protocol_source_t;

/* Non-blocking automatic six-face accelerometer calibration. */
#if APP_ACC_CAL_ENABLE
typedef struct {
  uint8_t active, face, face_mask, candidate;
  uint8_t source, seq;
  uint32_t start_ms, face_start_ms, stable_ms, collect_ms;
  uint32_t samples;
  float sum[3];
  float face_mean[6][3];
} acc_cal_runtime_t;
static acc_cal_runtime_t acc_cal_rt;
#endif
volatile struct {
  uint32_t magic, seq, millis;
  uint8_t status, face, detected_face, face_mask;
  uint16_t sample_count;
  uint16_t reserved;
  float bias_g[3], scale[3];
} acc_cal_status_live = {0x41434353U,0U,0U,0U,0U,0U,0U,0U,0U,{0},{1.0f,1.0f,1.0f}};

static protocol_parser_t uart_protocol_parser;
static protocol_parser_t usb_protocol_parser;
static stream_mode_t app_stream_mode = STREAM_MODE_VOFA_3CH;
static fusion_mode_t app_fusion_mode = FUSION_MODE_9AXIS;
static uint8_t app_relative_yaw_enabled;
static volatile uint8_t protocol_reset_pending;
static volatile uint8_t app_settings_mode;
static volatile uint8_t app_settings_dirty;

static void protocol_send_frame(protocol_source_t source, const uint8_t *frame, uint16_t len)
{
  if(source == PROTOCOL_SOURCE_UART)
    (void)uart_dma_send(frame, len);
  else
    (void)usb_cdc_write(frame, len);
}

static void protocol_reply_ack(protocol_source_t source, uint8_t seq,
                               uint8_t cmd_id, uint8_t status, uint16_t detail)
{
  uint8_t frame[AHRS_MAX_FRAME_LEN];
  uint16_t len = protocol_pack_ack(frame, seq, cmd_id, status, detail);
  if(len != 0U) protocol_send_frame(source, frame, len);
}

