Mathonix/AT32F423_LSM6DSV/src/app/main.c
    /* Motion hysteresis and time confirmation keep Q/R and prediction mode
     * from chattering around the original 0.5 dps threshold. */
    {
      const float confirm_s = (float)APP_VOFA_YAW_KF_MOTION_CONFIRM_MS * 0.001f;
      if(!motion_active)
      {
        motion_off_time = 0.0f;
        if(rate_norm_lpf >= APP_VOFA_YAW_KF_MOTION_START_DPS)
        {
          motion_on_time += dt;
          if(motion_on_time >= confirm_s)
          {
            motion_active = 1U;
            motion_on_time = 0.0f;
          }
        }
        else
        {
          motion_on_time = 0.0f;
        }
      }
      else
      {
        motion_on_time = 0.0f;
        if(rate_norm_lpf <= APP_VOFA_YAW_KF_MOTION_STOP_DPS)
        {
          motion_off_time += dt;
          if(motion_off_time >= confirm_s)
          {
            motion_active = 0U;
            motion_off_time = 0.0f;
          }
        }
        else
        {
          motion_off_time = 0.0f;
        }
      }
    }

    if(motion_den <= 0.0f)
      motion = motion_active ? 1.0f : 0.0f;
    else
      motion = (rate_norm_lpf - APP_VOFA_YAW_KF_MOTION_START_DPS) / motion_den;
    if(motion < 0.0f) motion = 0.0f;
    if(motion > 1.0f) motion = 1.0f;
    /* Smooth the transition so Q/R do not jump at the threshold. */
    motion = motion * motion * (3.0f - 2.0f * motion);
    if(vqf_live.rest_detected != 0U && !motion_active)
      motion = 0.0f;

    yaw_q = APP_VOFA_YAW_KF_Q_REST_DEG2_PER_S +
            (APP_VOFA_YAW_KF_Q_MOVE_DEG2_PER_S -
             APP_VOFA_YAW_KF_Q_REST_DEG2_PER_S) * motion;
    yaw_r_base = APP_VOFA_YAW_KF_R_REST_DEG2 +
                 (APP_VOFA_YAW_KF_R_MOVE_DEG2 -
                  APP_VOFA_YAW_KF_R_REST_DEG2) * motion;

    /* Increase measurement uncertainty when the acceleration magnitude is
     * inconsistent with 1 g. This keeps dynamic acceleration from being
     * mistaken for a reliable VQF yaw correction. */
    acc_norm = sqrtf(vqf_live.ax * vqf_live.ax +
                     vqf_live.ay * vqf_live.ay +
                     vqf_live.az * vqf_live.az);
    acc_disturbance = 0.0f;
    if(APP_VOFA_YAW_KF_ACC_NORM_TOL_G > 0.0f)
    {
      acc_disturbance = (fabsf(acc_norm - 1.0f) -
                         APP_VOFA_YAW_KF_ACC_NORM_TOL_G) /
                        APP_VOFA_YAW_KF_ACC_NORM_TOL_G;
      if(acc_disturbance < 0.0f) acc_disturbance = 0.0f;
      if(acc_disturbance > 1.0f) acc_disturbance = 1.0f;
    }
    if(APP_VOFA_YAW_KF_R_ACCEL_DEG2 > yaw_r_base)
      yaw_r_base += (APP_VOFA_YAW_KF_R_ACCEL_DEG2 - yaw_r_base) *
                    acc_disturbance;
    if(yaw_r_base < p_floor) yaw_r_base = p_floor;
    if(yaw_q < 0.0f) yaw_q = 0.0f;

    if(!filter_init)
    {
      yaw_kf = vqf_live.yaw;
      yaw_kf_var = yaw_r_base;
      innovation_var = yaw_kf_var + yaw_r_base;
      yaw_kf_r_scale = 1.0f;
      filter_init = 1U;
    }
#if APP_VOFA_REST_HOLD_ENABLE
    /* Lock the complete attitude output after VQF confirms a rest state.
     * VQF and its telemetry continue running underneath this output hold. */
    if(vqf_live.rest_detected != 0U)
    {
      if(!rest_hold)
      {
        rest_yaw = yaw_kf;
        rest_pitch = vqf_live.pitch;
        rest_roll = vqf_live.roll;
        rest_hold = 1U;
      }
    }
    else
    {
      rest_hold = 0U;
    }
#endif
#if APP_VOFA_REST_HOLD_ENABLE
    if(!rest_hold)
#endif
    {
      /* Do not integrate residual gyro noise while stationary. At rest the
       * state is held and only slowly corrected by the yaw measurement. Once
       * confirmed motion is detected, use gyro propagation for prompt
       * response. */
      yaw_pred = yaw_kf;
      if(motion_active)
        yaw_pred = wrap_deg(yaw_kf + yaw_rate * dt);
      p_pred = yaw_kf_var + yaw_q * dt;
      if(!(p_pred >= p_floor)) p_pred = p_floor;
      innovation = wrap_deg(vqf_live.yaw - yaw_pred);

      /* Adapt R only during confirmed rest. It is increased when the
       * innovation variance is persistently larger than expected and then
       * slowly returns to the configured baseline. */
      {
        float r_alpha = 1.0f;
        float target_scale = 1.0f;
        float estimated_r;
        if(APP_VOFA_YAW_KF_R_ADAPT_TAU_S > 0.0f)
        {
          r_alpha = 1.0f - expf(-dt / APP_VOFA_YAW_KF_R_ADAPT_TAU_S);
          if(r_alpha < 0.0f) r_alpha = 0.0f;
          if(r_alpha > 1.0f) r_alpha = 1.0f;
        }
        if((!motion_active) && (vqf_live.rest_detected != 0U))
        {
          innovation_var += r_alpha * (innovation * innovation - innovation_var);
          estimated_r = innovation_var - p_pred;
          if(estimated_r > yaw_r_base)
            target_scale = estimated_r / yaw_r_base;
        }
        else
        {
          innovation_var += r_alpha *
                            ((p_pred + yaw_r_base) - innovation_var);
        }
        if(target_scale < 1.0f) target_scale = 1.0f;
        if(target_scale > APP_VOFA_YAW_KF_R_ADAPT_MAX_SCALE)
          target_scale = APP_VOFA_YAW_KF_R_ADAPT_MAX_SCALE;
        yaw_kf_r_scale += r_alpha * (target_scale - yaw_kf_r_scale);
        if(yaw_kf_r_scale < 1.0f) yaw_kf_r_scale = 1.0f;
        if(yaw_kf_r_scale > APP_VOFA_YAW_KF_R_ADAPT_MAX_SCALE)
          yaw_kf_r_scale = APP_VOFA_YAW_KF_R_ADAPT_MAX_SCALE;
      }

      yaw_r = yaw_r_base * yaw_kf_r_scale;

      /* Soft innovation gate: inflate R rather than dropping the sample,
       * so the filter can recover from a real turn without a hard step. */
      {
        float innovation_gate = APP_VOFA_YAW_KF_INNOVATION_GATE_SIGMA *
                                 sqrtf(p_pred + yaw_r);
        float motion_allowance = 2.0f * rate_norm_lpf * dt +
                                 APP_VOFA_YAW_KF_INNOVATION_GATE_MIN_DEG;
        float gate_factor;
        float max_gate_factor = sqrtf(APP_VOFA_YAW_KF_R_ADAPT_MAX_SCALE);
        if(innovation_gate < APP_VOFA_YAW_KF_INNOVATION_GATE_MIN_DEG)
          innovation_gate = APP_VOFA_YAW_KF_INNOVATION_GATE_MIN_DEG;
        if(motion_active && innovation_gate < motion_allowance)
          innovation_gate = motion_allowance;
        if(fabsf(innovation) > innovation_gate)
        {
          gate_factor = fabsf(innovation) / innovation_gate;
          if(gate_factor > max_gate_factor) gate_factor = max_gate_factor;
          yaw_r *= gate_factor * gate_factor;
        }
      }

      {
        float k = p_pred / (p_pred + yaw_r);
        if(k < 0.0f) k = 0.0f;
        if(k > 1.0f) k = 1.0f;
        yaw_kf = wrap_deg(yaw_pred + k * innovation);
        yaw_kf_var = (1.0f - k) * p_pred;
        if(yaw_kf_var < p_floor) yaw_kf_var = p_floor;
      }
    }
  }

#if APP_VOFA_REST_HOLD_ENABLE
  if(rest_hold)
  {
    output_yaw = rest_yaw;
    output_pitch = rest_pitch;
    output_roll = rest_roll;
  }
  else
#endif
  {
    output_yaw = yaw_kf;
    output_pitch = vqf_live.pitch;
    output_roll = vqf_live.roll;
  }

  /* Relative yaw is an output-reference option only. The VQF/KF state and
   * magnetometer fusion remain unchanged; latch the first published yaw as
   * the boot reference. */
  if(app_relative_yaw_enabled != 0U)
  {
    static uint8_t relative_yaw_initialized;
    if(relative_yaw_initialized == 0U)
    {
      app_yaw_offset = wrap_deg(output_yaw);
      relative_yaw_initialized = 1U;
    }
  }
  output_yaw = wrap_deg(output_yaw - app_yaw_offset);

