Mathonix/AT32F423_LSM6DSV/src/app/main.c
  vofa_pose_live.seq++;
  __DMB();
  vofa_pose_live.yaw = output_yaw;
  vofa_pose_live.pitch = output_pitch;
  vofa_pose_live.roll = output_roll;
  vofa_pose_live.temperature_c = imu_temp_live.temperature_c;
  vofa_pose_live.millis = millis();
  __DMB();
  vofa_pose_live.seq++;

  /* Keep a compact, sequence-locked copy for high-rate DAPLink capture. */
  yaw_sync_div++;
  if(yaw_sync_div >= YAW_KF_SYNC_DIV)
  {
    yaw_sync_div = 0U;
    yaw_kf_sync_live.seq++;
    __DMB();
    yaw_kf_sync_live.millis = vofa_pose_live.millis;
    yaw_kf_sync_live.vqf_yaw = vqf_live.yaw;
    yaw_kf_sync_live.kf_yaw = output_yaw;
    yaw_kf_sync_live.gz = vqf_live.gz;
    yaw_kf_sync_live.bias_z = vqf_live.bias_z;
    yaw_kf_sync_live.rest_detected = vqf_live.rest_detected;
    yaw_kf_sync_live.mag_updates = vqf_live.mag_updates;
    yaw_kf_sync_live.temperature_c = vqf_live.temperature_c;
    yaw_kf_sync_live.gyr_lpf_z = vqf_live.gyr_lpf_z;
    yaw_kf_sync_live.corrected_z = vqf_live.corrected_z;
    __DMB();
    yaw_kf_sync_live.seq++;
  }

  /* Send yaw, pitch and roll as a continuous 3-channel JustFloat frame.
   At APP_VOFA_OUTPUT_HZ=1000 this is 16 bytes every 1 ms. */
  ch[0]  = output_yaw;
  ch[1]  = output_pitch;
  ch[2]  = output_roll;
  memcpy(pkt, ch, VOFA_N_CH * 4U);
  memcpy(pkt + (VOFA_N_CH * 4U), tail, 4U);
  (void)usb_cdc_write(pkt, (uint16_t)VOFA_BYTES);
  if(uart_dma_send(pkt, (uint16_t)VOFA_BYTES) == 0)
  {
    vofa_sel ^= 1U;
  }
  else
  {
    vofa_late++;
  }

#if APP_CAN_ENABLE
  can_test_update_data(output_roll, output_pitch, output_yaw,
                       vqf_live.gx, vqf_live.gy, vqf_live.gz,
                       vqf_live.ax, vqf_live.ay, vqf_live.az,
                       vqf_live.qw, vqf_live.qx, vqf_live.qy, vqf_live.qz,
                       imu_temp_live.temperature_c,
                       (uint8_t)vqf_live.rest_detected);
#endif
}

static void live_init(void)
{
  vqf_live.magic = VQF_LIVE_MAGIC;
  vqf_live.seq = 0;
  vqf_live.init_err = 0;
  vqf_live.whoami = 0;
  vqf_live.clk_hz = system_core_clock;
  vqf_live.millis = 0;
  vqf_live.fusion_hz = 0;
  vqf_live.out_hz = 0;
  vqf_live.fusion_n = 0;
  vqf_live.skip_n = 0;
  vqf_live.vqf_us = 0;
  vqf_live.bias_x = 0.0f;
  vqf_live.bias_y = 0.0f;
  vqf_live.bias_z = 0.0f;
  vqf_live.rest_time = 0.0f;
  vqf_live.tau_acc = 0.0f;
  vqf_live.rest_detected = 0U;
  vqf_live.mag_err = -1;
  vqf_live.mag_addr = 0U;
  vqf_live.mag_updates = 0U;
  vqf_live.mag_ready = 0U;
  vqf_live.temperature_c = APP_GYR_TEMP_REF_C;
  vqf_live.gyr_lpf_z = 0.0f;
  vqf_live.corrected_z = 0.0f;

  memset((void *)&vqf_tune_live, 0, sizeof(vqf_tune_live));
  vqf_tune_live.magic = VQF_TUNE_MAGIC;
}

static void live_whoami(void)
{
  uint8_t who = 0xFFU;
  (void)lsm6dsv_read_reg(LSM6DSV_WHO_AM_I_REG, &who);
  vqf_live.whoami = who;
}

/* Keep the application observable and recoverable when the IMU is absent or
 * SPI initialization fails. The old implementation stopped forever here,
 * leaving the last SRAM telemetry snapshot looking like a valid zero-drift
 * result and preventing a later sensor reconnection from recovering. */
static int sensor_init_retry_loop(int initial_err)
{
  uint32_t next_retry_ms = 0U;
  uint32_t last_led_ms = 0U;
  int err = initial_err;

  vqf_live.init_err = err;
  for(;;)
  {
    const uint32_t now = millis();
    live_whoami();
    vqf_live.init_err = err;
    vqf_live.millis = now;
    vqf_live.fusion_hz = 0U;
    vqf_live.out_hz = 0U;
    vqf_live.seq++;
    /* Publish a changing sequence in the exact live block used by DAPLink
     * tools, so stale SRAM is never mistaken for a valid zero-drift record. */
    vqf_tune_live.millis = now;
    vqf_tune_live.fusion_hz = 0U;
    vqf_tune_live.seq++;

    /* Keep the host link serviced so the failure remains diagnosable. */
    usb_cdc_task();
    if((uint32_t)(now - last_led_ms) >= 200U)
    {
      last_led_ms = now;
      ws2812_show_error(1U);
      led_toggle();
    }

    if((int32_t)(now - next_retry_ms) >= 0)
    {
      (void)lsm6dsv_spi_recover();
      err = lsm6dsv_init_2khz();
      live_whoami();
      if(err == 0)
      {
        vqf_live.init_err = 0;
        return 0;
      }
      next_retry_ms = millis() + 500U;
    }
    delay_ms(10U);
  }
}
#define APP_BOOT_REQUEST_ADDR 0x2000BFF0U
#define APP_BOOT_REQUEST_MAGIC 0x424F4F54U
static void app_request_bootloader(void){ *((volatile uint32_t *)APP_BOOT_REQUEST_ADDR) = APP_BOOT_REQUEST_MAGIC; __DMB(); nvic_system_reset(); }

int main(void)
{
  SCB->VTOR = 0x08008000U;
  lsm6dsv_raw_t raw;
  float gyr[3];
  float acc[3];
  float mag[3] = {0.0f, 0.0f, 0.0f};
  float q[4];
  float roll;
  float pitch;
  float yaw;
  uint32_t fusion_n = 0;
  uint32_t out_n = 0;
  uint32_t skip_n = 0;
  uint32_t last_ms;
  uint32_t fusion_hz = 0;
  int err;
  int mag_err;
  uint8_t mag_ok;
  uint8_t mag_pending;
  uint32_t mag_start_n;
  uint32_t mag_updates;
  uint32_t mag_read_n;
  uint32_t t0;
  uint32_t vqf_us;
  uint32_t i;
  float temp_c = APP_GYR_TEMP_REF_C;
  uint8_t bias_fallback = 0U;
  uint8_t bias_history_write_error = 0U;
#if APP_SFLP_BIAS_ENABLE
  float sflp_bias_dps[3] = {0.0f, 0.0f, 0.0f};
  uint8_t sflp_bias_ok = 0U;
#endif
  float gyr_lpf[3] = {0.0f, 0.0f, 0.0f};
  uint8_t gyr_lpf_init = 0U;
  const float gyr_lpf_alpha = 1.0f - expf(-6.28318530718f * GYR_LPF_CUTOFF_HZ / FUSION_HZ);

  system_clock_config();
  bsp_init();
  ws2812_init();
  live_init();
  lsm6dsv_spi_init();
#if APP_ACC_CAL_ENABLE
  acc_calibration_load();
#endif
#if APP_CAN_ENABLE
  can_test_init();
#endif
  usb_cdc_init();
  protocol_parser_init(&uart_protocol_parser, protocol_frame_received,
                       (void *)(uintptr_t)PROTOCOL_SOURCE_UART);
  protocol_parser_init(&usb_protocol_parser, protocol_frame_received,
                       (void *)(uintptr_t)PROTOCOL_SOURCE_USB);
  {
    uint16_t stored_can_id = APP_CAN_DEFAULT_CAN_ID;
    (void)fusion_settings_load_ex(&app_fusion_mode, &stored_can_id);
    (void)can_test_set_node_id(stored_can_id);
  }
  app_relative_yaw_enabled = (app_fusion_mode == FUSION_MODE_9AXIS_RELATIVE) ? 1U : 0U;
  delay_ms(20);

#if APP_SFLP_BIAS_ENABLE
  if(lsm6dsv_read_sflp_gbias(sflp_bias_dps, APP_SFLP_BIAS_SETTLE_MS) == 0)
  {
    sflp_bias_ok = 1U;
  }
#endif
  live_whoami();
  err = lsm6dsv_init_2khz();
  live_whoami();
  if(err != 0)
  {
    (void)sensor_init_retry_loop(err);
  }

  mag_err = ist8310_init();
  mag_ok = ((mag_err == 0) && (app_fusion_mode != FUSION_MODE_6AXIS)) ? 1U : 0U;
  mag_pending = 0U;
  mag_start_n = 0U;
  mag_updates = 0U;
  mag_read_n = 0U;
  vqf_live.mag_err = mag_err;
  vqf_live.mag_addr = ist8310_get_addr();

  vqf_init(1.0f / FUSION_HZ, 1.0f / FUSION_HZ);
  {
    float block_gyr_sum[3] = {0.0f, 0.0f, 0.0f};
    float block_acc_sum[3] = {0.0f, 0.0f, 0.0f};
    float gyr_bias[3];
    float acc_avg[3];
    uint32_t block_samples = 0U;
    uint32_t block_count = 0U;
    /* Discard samples for the configured settling time.  This used to be
     * hard-coded to FUSION_HZ/5 (200 ms), so APP_CAL_DROP_MS had no effect. */
    uint32_t drop_n = ((FUSION_RATE_HZ * (uint32_t)CAL_DROP_MS) + 999U) /
                      1000U;
    uint32_t cal_n = (uint32_t)((float)FUSION_RATE_HZ * CAL_REST_SECONDS + 0.5f);
    uint32_t target_blocks;
    uint32_t target_samples;
    uint32_t tries;
    uint32_t got = 0U;
    uint32_t cal_start_ms;
    uint8_t cal_timeout = 0U;
    float acc_n3;
    float gyr_n;
    float cal_temp_sum = 0.0f;
    uint32_t cal_temp_samples = 0U;
    float calibration_temp_c = APP_GYR_TEMP_REF_C;

    if(CAL_BLOCK_SAMPLES == 0U || CAL_BLOCK_MAX == 0U)
    {
      (void)sensor_init_retry_loop(-21);
    }
    target_blocks = (cal_n + CAL_BLOCK_SAMPLES - 1U) / CAL_BLOCK_SAMPLES;
    if(target_blocks == 0U) target_blocks = 1U;
    if(target_blocks > CAL_BLOCK_MAX) target_blocks = CAL_BLOCK_MAX;
    target_samples = target_blocks * CAL_BLOCK_SAMPLES;

