Mathonix/AT32F423_LSM6DSV/src/app/main.c
    tries = 0U;
    while((got < drop_n) && (tries < (drop_n * 4U)))
    {
      ws2812_calibration_task(millis());
      tries++;
      if(lsm6dsv_wait_sample(2000U) != 0)
      {
        continue;
      }
      if(lsm6dsv_read_raw(&raw) != 0)
      {
        continue;
      }
      got++;
      (void)update_temperature(raw.temp_raw);
    }

    /* Allow one extra second beyond the requested rest-capture duration.
     * With APP_CAL_REST_SECONDS=3 s, the capture window is 4 s. */
    cal_start_ms = millis();
    tries = 0U;
    while((cal_timeout == 0U) &&
          (block_count < target_blocks) &&
          (tries < (target_samples * 4U)))
    {
      ws2812_calibration_task(millis());
      if((uint32_t)(millis() - cal_start_ms) >=
         (uint32_t)((CAL_REST_SECONDS + 1.0f) * 1000.0f))
      {
        cal_timeout = 1U;
        break;
      }
      tries++;
      if(lsm6dsv_wait_sample(2000U) != 0)
      {
        continue;
      }
      if(lsm6dsv_read_raw(&raw) != 0)
      {
        continue;
      }
      temp_c = update_temperature(raw.temp_raw);
      for(i = 0; i < 3U; i++)
      {
        gyr[i] = gyro_dps_from_raw(i, raw.gyr[i], temp_c) * DEG2RAD;
  #if APP_ACC_CAL_ENABLE
      acc[i] = acc_calibrate_g(i, (float)raw.acc[i] * ACC_G_PER_LSB) * G_TO_MS2;
#else
      acc[i] = (float)raw.acc[i] * ACC_G_PER_LSB * G_TO_MS2;
#endif
      }
      gyr_n = sqrtf(gyr[0] * gyr[0] + gyr[1] * gyr[1] + gyr[2] * gyr[2]);
      acc_n3 = sqrtf(acc[0] * acc[0] + acc[1] * acc[1] + acc[2] * acc[2]);
      if((gyr_n > (CAL_GYR_REST_DPS * DEG2RAD)) ||
         (fabsf(acc_n3 - G_TO_MS2) > CAL_ACC_REST_MS2))
      {
        continue;
      }
      cal_temp_sum += temp_c;
      cal_temp_samples++;
      for(i = 0U; i < 3U; ++i)
      {
        block_gyr_sum[i] += gyr[i];
        block_acc_sum[i] += acc[i];
      }
      block_samples++;
      if(block_samples >= CAL_BLOCK_SAMPLES)
      {
        for(i = 0U; i < 3U; ++i)
        {
          cal_gyr_blocks[i][block_count] =
              block_gyr_sum[i] / (float)CAL_BLOCK_SAMPLES;
          cal_acc_blocks[i][block_count] =
              block_acc_sum[i] / (float)CAL_BLOCK_SAMPLES;
          block_gyr_sum[i] = 0.0f;
          block_acc_sum[i] = 0.0f;
        }
        block_samples = 0U;
        block_count++;
      }
    }
    /* A complete stationary window is required before accepting this boot's
     * gyro bias.  If it fails, use the persistent history instead of halting
     * the application.  A timeout also discards partial blocks so the VQF
     * prime uses the same fallback path as a failed static calibration. */
    if(cal_timeout != 0U)
    {
      block_count = 0U;
      block_samples = 0U;
    }
    {
      const uint8_t current_cal_ok = (uint8_t)((cal_timeout == 0U) &&
                                               (block_count >= target_blocks));
      float history_latest[3] = {0.0f, 0.0f, 0.0f};
      float history_average[3] = {0.0f, 0.0f, 0.0f};
      float history_nearest[3] = {0.0f, 0.0f, 0.0f};
      float history_nearest_temp = 0.0f;
      uint32_t history_count = 0U;
      uint8_t history_nearest_valid = 0U;
      uint8_t history_corrupt = 0U;
      int history_valid;

      if(block_count > 0U)
      {
        /* Trim 10% of the block means at both ends. */
        for(i = 0U; i < 3U; ++i)
        {
          gyr_bias[i] = trimmed_mean(cal_gyr_blocks[i], block_count);
          acc_avg[i] = trimmed_mean(cal_acc_blocks[i], block_count);
        }
      }
      else
      {
        acc_avg[0] = 0.0f;
        acc_avg[1] = 0.0f;
        acc_avg[2] = G_TO_MS2;
      }

      history_valid = gyro_bias_history_load_for_temp(
          history_latest, history_average, history_nearest, temp_c,
          CAL_BIAS_TEMP_WINDOW_C, &history_nearest_temp,
          &history_nearest_valid, &history_count, &history_corrupt);
      if(current_cal_ok != 0U)
      {
#if APP_SFLP_BIAS_ENABLE
        if((sflp_bias_ok != 0U) &&
           (fabsf(sflp_bias_dps[0]) <= APP_SFLP_BIAS_MAX_DPS) &&
           (fabsf(sflp_bias_dps[1]) <= APP_SFLP_BIAS_MAX_DPS) &&
           (fabsf(sflp_bias_dps[2]) <= APP_SFLP_BIAS_MAX_DPS))
        {
          gyr_bias[0] = sflp_bias_dps[0] * DEG2RAD;
          gyr_bias[1] = sflp_bias_dps[1] * DEG2RAD;
          gyr_bias[2] = sflp_bias_dps[2] * DEG2RAD;
        }
#endif
        /* Save the mean temperature of the same accepted stationary samples
         * used to calculate this bias. */
        if(cal_temp_samples != 0U)
          calibration_temp_c = cal_temp_sum / (float)cal_temp_samples;
        if(gyro_bias_history_save_at_temp(gyr_bias, calibration_temp_c) != 0)
        {
          bias_history_write_error = 1U;
        }
      }
      else
      {
        bias_fallback = 1U;
        if((history_valid != 0) && (history_nearest_valid != 0U))
        {
          for(i = 0U; i < 3U; ++i) gyr_bias[i] = history_nearest[i];
        }
        else if((history_valid != 0) && (history_count >= GYRO_BIAS_HISTORY_MAX))
        {
          for(i = 0U; i < 3U; ++i) gyr_bias[i] = history_average[i];
        }
        else if(history_valid != 0)
        {
          /* Fewer than 15 records: use the most recent intact calibration. */
          for(i = 0U; i < 3U; ++i) gyr_bias[i] = history_latest[i];
        }
        else
        {
          gyr_bias[0] = APP_GYR_DEFAULT_BIAS_X_DPS * DEG2RAD;
          gyr_bias[1] = APP_GYR_DEFAULT_BIAS_Y_DPS * DEG2RAD;
          gyr_bias[2] = APP_GYR_DEFAULT_BIAS_Z_DPS * DEG2RAD;
        }
        (void)history_nearest_temp;
        (void)history_corrupt; /* CRC-invalid/power-loss records are ignored. */
      }
    }
    vqf_prime_rest(acc_avg, gyr_bias);
  }
  vqf_live.seq = 2;
  last_ms = millis();
  /* In 6-axis mode a missing/disabled magnetometer is expected; do not
   * replace the normal status LED with a permanent amber error. */
  if((!mag_ok) && (app_fusion_mode != FUSION_MODE_6AXIS))
    ws2812_show_error(2U);

  {
    uint32_t last_sample_cy = dwt_cycles();
    uint32_t err_streak = 0U;

  while(1)
  {
    uint32_t now_cy;
    uint32_t dt_cy;

    if(lsm6dsv_wait_sample(2000U) != 0)
    {
      skip_n++;
      err_streak++;
      goto recover_or_continue;
    }
    if(lsm6dsv_read_raw(&raw) != 0)
    {
      skip_n++;
      err_streak++;
      goto recover_or_continue;
    }

