Mathonix/AT32F423_LSM6DSV/src/app/main.c
    /* Temperature is part of the same 14-byte SPI burst as gyro/accel.
     * temp_c is the filtered value used by the optional gyro compensation;
     * imu_temp_live.temperature_c remains the raw converted telemetry value. */
    temp_c = update_temperature(raw.temp_raw);

    now_cy = dwt_cycles();
    dt_cy = now_cy - last_sample_cy;
    last_sample_cy = now_cy;
    if((fusion_n > 0U) && (dt_cy > DROP_DT_CYCLES))
    {
      skip_n++;
      err_streak = 0U;
      continue;
    }
    err_streak = 0U;

    for(i = 0; i < 3U; i++)
    {
      gyr[i] = gyro_dps_from_raw(i, raw.gyr[i], temp_c) * DEG2RAD;
#if APP_ACC_CAL_ENABLE
      acc[i] = acc_calibrate_g(i, (float)raw.acc[i] * ACC_G_PER_LSB) * G_TO_MS2;
#else
      acc[i] = (float)raw.acc[i] * ACC_G_PER_LSB * G_TO_MS2;
#endif
    }

#if APP_ACC_CAL_ENABLE
    { float raw_acc_g[3] = { (float)raw.acc[0] * ACC_G_PER_LSB, (float)raw.acc[1] * ACC_G_PER_LSB, (float)raw.acc[2] * ACC_G_PER_LSB };
      float gyr_dps_now[3] = { gyr[0] / DEG2RAD, gyr[1] / DEG2RAD, gyr[2] / DEG2RAD };
      acc_calibration_sample_task(millis(), raw_acc_g, gyr_dps_now); }
#endif

    /* Configurable gyro low-pass reduces white noise without changing the
     * 2 kHz fusion cadence. The first sample seeds the filter. */
    if(!gyr_lpf_init)
    {
      for(i = 0; i < 3U; i++) gyr_lpf[i] = gyr[i];
      gyr_lpf_init = 1U;
    }
    else
    {
      for(i = 0; i < 3U; i++)
      {
        gyr_lpf[i] += gyr_lpf_alpha * (gyr[i] - gyr_lpf[i]);
      }
    }

    t0 = dwt_cycles();
    vqf_update(gyr_lpf, acc);
    /* Non-blocking 50 Hz magnetometer scheduler: never wait 5 ms inside
     * the 2 kHz IMU/VQF path. Only the short I2C trigger/read transactions
     * occupy the loop. */
    if(mag_ok)
    {
      if(!mag_pending && ((fusion_n % MAG_PERIOD_N) == 0U))
      {
        mag_err = ist8310_start_measurement();
        if(mag_err == 0)
        {
          mag_pending = 1U;
          mag_start_n = fusion_n;
        }
      }
      else if(mag_pending && ist8310_data_ready())
      {
        int16_t mag_raw[3];
        mag_err = ist8310_read_ready(mag_raw);
        mag_pending = 0U;
        if(mag_err == 0)
        {
          mag_raw_live.seq++;
          __DMB();
          mag_raw_live.millis = millis();
          mag_raw_live.x = mag_raw[0];
          mag_raw_live.y = mag_raw[1];
          mag_raw_live.z = mag_raw[2];
          mag_raw_live.sample_n++;
          __DMB();
          mag_raw_live.seq++;
          /* Calibrate in IST8310 axes first, then map once into LSM6DSV axes.
           * Raw telemetry above stays in original IST8310 register axes. */
          {
            float uncal_centered[3];
            float calibrated_mag[3];
            unsigned row, col;
            for(row = 0; row < 3U; ++row)
              uncal_centered[row] = (float)mag_raw[row] * MAG_UT_PER_LSB - mag_cal_offset[row];
            for(row = 0; row < 3U; ++row)
            {
              calibrated_mag[row] = 0.0f;
              for(col = 0; col < 3U; ++col)
                calibrated_mag[row] += mag_cal_matrix[row][col] * uncal_centered[col];
            }
            mag_map_to_imu(calibrated_mag, mag);
          }
          mag_read_n++;
          /* Official Full VQF's disturbance rejection uses atan2/asin and a
           * second-order filter. Run that at 10 Hz so it cannot steal a 2 kHz
           * gyro sample; the latest 50 Hz field vector remains in telemetry. */
#if MAG_FUSION_ENABLE
          if(((mag_read_n - 1U) % MAG_VQF_DIV) == 0U)
          {
            if(vqf_update_mag(mag) == 0) mag_updates++;
          }
#endif
        }
      }
      else if(mag_pending && ((fusion_n - mag_start_n) > MAG_TIMEOUT_N))
      {
        mag_err = -4;
        mag_pending = 0U;
      }
    }
    vqf_us = (dwt_cycles() - t0) / (system_core_clock / 1000000U);
    fusion_n++;

    if((fusion_n % OUTPUT_DIV) == 0U)
    {
      /* Odd/even sequence lock lets DAPLink read a coherent live snapshot
       * without halting the 2 kHz fusion loop. */
      vqf_live.seq++;
      __DMB();
      vqf_get_quat9d(q);
      vqf_get_euler_deg(&roll, &pitch, &yaw);

      vqf_live.roll = roll;
      vqf_live.pitch = pitch;
      vqf_live.yaw = yaw;
      vqf_live.qw = q[0];
      vqf_live.qx = q[1];
      vqf_live.qy = q[2];
      vqf_live.qz = q[3];
      vqf_live.gx = (float)raw.gyr[0] * GYR_DPS_PER_LSB;
      vqf_live.gy = (float)raw.gyr[1] * GYR_DPS_PER_LSB;
      vqf_live.gz = (float)raw.gyr[2] * GYR_DPS_PER_LSB;
      vqf_live.ax = (float)raw.acc[0] * ACC_G_PER_LSB;
      vqf_live.ay = (float)raw.acc[1] * ACC_G_PER_LSB;
      vqf_live.az = (float)raw.acc[2] * ACC_G_PER_LSB;
      {
        float live_bias[3];
        vqf_get_gyr_bias(live_bias);
        vqf_live.bias_x = live_bias[0] / DEG2RAD;
        vqf_live.bias_y = live_bias[1] / DEG2RAD;
        vqf_live.bias_z = live_bias[2] / DEG2RAD;
      }
      /* gyr_lpf_z is the (temperature-compensated) signal actually supplied
       * to VQF. corrected_z is its residual after VQF's current bias estimate;
       * both fields are exposed in dps for direct drift diagnosis. */
      vqf_live.temperature_c = imu_temp_live.temperature_c;
      vqf_live.gyr_lpf_z = gyr_lpf[2] / DEG2RAD;
      vqf_live.corrected_z = vqf_live.gyr_lpf_z - vqf_live.bias_z;
      vqf_live.rest_time = vqf_get_rest_time();
      vqf_live.tau_acc = vqf_get_tau_acc();
      vqf_live.rest_detected = (uint32_t)vqf_get_rest_detected();
      vqf_live.mx = mag[0];
      vqf_live.my = mag[1];
      vqf_live.mz = mag[2];
      vqf_live.mag_norm = sqrtf(mag[0]*mag[0] + mag[1]*mag[1] + mag[2]*mag[2]);
      vqf_live.tau_mag = vqf_get_tau_mag();
      vqf_live.mag_err = mag_err;
      vqf_live.mag_updates = mag_updates;
      vqf_live.mag_ready = (uint32_t)vqf_get_mag_ready();
      vqf_live.mag_disturbed = (uint32_t)vqf_get_mag_dist_detected();
      vqf_live.vqf_us = vqf_us;
      vqf_live.fusion_n = fusion_n;
      vqf_live.skip_n = skip_n;
      vqf_live.millis = millis();
      __DMB();
      vqf_live.seq++;
      out_n++;

      if((fusion_n % DAP_OUTPUT_DIV) == 0U)
      {
        acc_cal_live.seq++;
        __DMB();
        acc_cal_live.millis = vqf_live.millis;
        for(i = 0U; i < 3U; ++i)
        {
          acc_cal_live.raw_g[i] = (float)raw.acc[i] * ACC_G_PER_LSB;
          acc_cal_live.corrected_g[i] = acc[i] / G_TO_MS2;
        }
        __DMB();
        acc_cal_live.seq++;
        vqf_tune_live.seq++;
        __DMB();
        vqf_tune_live.millis = vqf_live.millis;
        vqf_tune_live.fusion_hz = vqf_live.fusion_hz;
        vqf_tune_live.skip_n = vqf_live.skip_n;
        vqf_tune_live.rest_detected = vqf_live.rest_detected;
        vqf_tune_live.roll = vqf_live.roll;
        vqf_tune_live.pitch = vqf_live.pitch;
        vqf_tune_live.yaw = vqf_live.yaw;
        vqf_tune_live.gx = vqf_live.gx;
        vqf_tune_live.gy = vqf_live.gy;
        vqf_tune_live.gz = vqf_live.gz;
        vqf_tune_live.ax = vqf_live.ax;
        vqf_tune_live.ay = vqf_live.ay;
        vqf_tune_live.az = vqf_live.az;
        vqf_tune_live.bias_x = vqf_live.bias_x;
        vqf_tune_live.bias_y = vqf_live.bias_y;
        vqf_tune_live.bias_z = vqf_live.bias_z;
        vqf_tune_live.rest_time = vqf_live.rest_time;
        vqf_tune_live.tau_acc = vqf_live.tau_acc;
        vqf_tune_live.temperature_c = vqf_live.temperature_c;
        vqf_tune_live.gyr_lpf_z = vqf_live.gyr_lpf_z;
        vqf_tune_live.corrected_z = vqf_live.corrected_z;
        vqf_tune_live.mx = vqf_live.mx;
        vqf_tune_live.my = vqf_live.my;
        vqf_tune_live.mz = vqf_live.mz;
        vqf_tune_live.mag_norm = vqf_live.mag_norm;
        vqf_tune_live.tau_mag = vqf_live.tau_mag;
        vqf_tune_live.mag_err = vqf_live.mag_err;
        vqf_tune_live.mag_addr = vqf_live.mag_addr;
        vqf_tune_live.mag_updates = vqf_live.mag_updates;
        vqf_tune_live.mag_ready = vqf_live.mag_ready;
        vqf_tune_live.mag_disturbed = vqf_live.mag_disturbed;
        __DMB();
        vqf_tune_live.seq++;
        vqf_nine_live.seq++;
        __DMB();
        vqf_nine_live.snapshot = vqf_tune_live;
        {
          float diagnostic[8];
          unsigned j;
          vqf_get_nine_diagnostic(diagnostic);
          for(j = 0U; j < 8U; ++j) vqf_nine_live.diagnostic[j] = diagnostic[j];
        }
        __DMB();
        vqf_nine_live.seq++;
      }
      vofa_send_justfloat((float)vofa_late);
    }

    usb_cdc_task();
    {
      uint8_t ch;
      static uint8_t uart_legacy_buf[4];
      static uint8_t uart_legacy_idx;
      static uint8_t usb_legacy_buf[4];
      static uint8_t usb_legacy_idx;
      while(uart_read_byte(&ch))
      {
        protocol_parser_feed_byte(&uart_protocol_parser, ch);
        legacy_command_feed(ch, uart_legacy_buf, &uart_legacy_idx);
      }
      while(usb_cdc_read_byte(&ch))
      {
        protocol_parser_feed_byte(&usb_protocol_parser, ch);
        legacy_command_feed(ch, usb_legacy_buf, &usb_legacy_idx);
      }
    }
    if(protocol_reset_pending != 0U)
    {
      protocol_reset_pending = 0U;
      app_request_bootloader();
    }

    {
      ws2812_mode_t led_mode = WS2812_MODE_6AXIS;
      /* A magnetometer sample must have reached VQF before advertising 9D.
       * Relative yaw is only an output reference and does not change this
       * nine-axis status indication. */
      if((mag_ok != 0U) && (vqf_get_mag_ready() != 0))
      {
        led_mode = WS2812_MODE_9AXIS;
      }
#if APP_ACC_CAL_ENABLE
      if(acc_cal_rt.active != 0U || acc_cal_status_live.status == ACC_CAL_STATUS_FAILED)
      {
        ws2812_acc_calibration_task(millis(), acc_cal_rt.face + 1U, acc_cal_rt.active, acc_cal_status_live.status == ACC_CAL_STATUS_FAILED);
      }
      else
#endif
      if(app_settings_mode != 0U)
      {
        /* Settings mode has priority over all status warnings and freezes
         * the LED brightness (no breathing). */
        ws2812_settings_task(millis(), led_mode);
      }
      else if((app_fusion_mode == FUSION_MODE_6AXIS) ||
              (mag_ok != 0U) || (APP_MAG_FUSION_ENABLE == 0U) ||
              (bias_fallback != 0U) || (bias_history_write_error != 0U) ||
              (app_settings_dirty != 0U))
      {
        ws2812_normal_task(millis(), led_mode,
                           bias_fallback,
                           (uint8_t)vqf_get_mag_dist_detected(),
                           app_settings_dirty,
                           bias_history_write_error);
      }
    }
#if APP_CAN_ENABLE
    /* CAN needs microsecond timing: the millisecond tick cannot schedule 1 kHz. */
    can_test_task(dwt_cycles() / (system_core_clock / 1000000U));
    {
      uint8_t cmd = can_test_get_cmd_flag();
      if(cmd & CAN_CMD_FLAG_REBOOT)
      {
        nvic_system_reset();
      }
      if(cmd & CAN_CMD_FLAG_ZERO_YAW)
      {
        can_test_clear_cmd_flag(CAN_CMD_FLAG_ZERO_YAW);
        app_zero_yaw(vofa_pose_live.yaw);
      }
      if(cmd & CAN_CMD_FLAG_RECAL)
      {
        can_test_clear_cmd_flag(CAN_CMD_FLAG_RECAL);
      }
    }
#endif

    if((millis() - last_ms) >= 1000U)
    {
      fusion_hz = fusion_n;
      vqf_live.fusion_hz = fusion_hz;
      vqf_live.out_hz = out_n;
      vqf_live.clk_hz = system_core_clock;
      fusion_n = 0;
      last_ms += 1000U;
      if(out_n >= 500U)
      {
        led_toggle();
      }
      out_n = 0;
    }
    continue;
recover_or_continue:
    if(err_streak >= ERR_STREAK_RECOVER)
    {
      (void)lsm6dsv_spi_recover();
      (void)lsm6dsv_init_2khz();
      live_whoami();
      err_streak = 0U;
    }
  }
  }
}
